avnet-iotconnect/iotc-mchp-dspic33ck-lvmcb/firmware/dspic33ck256mp508_rnwf11_iotconnect.X/iotconnect/iotconnect_rnwf11.c
static bool IOTC_RNWF11_Configure(void)
{
    char command[256];

    /* Order matches the reference RNWF11 driver (main branch): WiFi is
     * brought up completely first as its own phase, then TLS+MQTT are
     * configured together right before connecting - not interleaved with
     * TLS config first, the way this file did before. */
    if (!IOTC_RNWF11_Step("AT", "AT\r\n")) return false;

    /* These are rejected while the station is already associated, which is fine. */
    snprintf(command, sizeof(command), "AT+WSTAC=1,\"%s\"\r\n", s_cfg.wifi_ssid);
    IOTC_RNWF11_StepQuiet(command);
    snprintf(command, sizeof(command), "AT+WSTAC=2,%u\r\n", IOTC_WIFI_SECURITY);
    IOTC_RNWF11_StepQuiet(command);
    snprintf(command, sizeof(command), "AT+WSTAC=3,\"%s\"\r\n", s_cfg.wifi_password);
    IOTC_RNWF11_StepQuiet(command);
    IOTC_RNWF11_StepQuiet("AT+WSTAC=4,0\r\n");
    if (!IOTC_RNWF11_WaitForNetwork()) return false;

    /* These are rejected once the module already has the identical value
     * persisted from an earlier provision_rnwf11_cert.py run (its own
     * non-volatile storage, unaffected by power cycling the host board) -
     * same "reject a no-op update" behavior already seen on WSTAC/SNTP, so
     * treat rejection as fine rather than aborting the whole sequence. */
    snprintf(command, sizeof(command), "AT+TLSC=1,1,\"%s\"\r\n", s_cfg.rnwf_ca_name);
    IOTC_RNWF11_StepQuiet(command);
    if (s_cfg.rnwf_cert_name[0] != '\0')
    {
        snprintf(command, sizeof(command), "AT+TLSC=1,2,\"%s\"\r\n", s_cfg.rnwf_cert_name);
        IOTC_RNWF11_StepQuiet(command);
    }
    if (s_cfg.rnwf_key_name[0] != '\0')
    {
        snprintf(command, sizeof(command), "AT+TLSC=1,3,\"%s\"\r\n", s_cfg.rnwf_key_name);
        IOTC_RNWF11_StepQuiet(command);
    }
    snprintf(command, sizeof(command), "AT+TLSC=1,5,\"%s\"\r\n", s_cfg.mqtt_broker_host);
    IOTC_RNWF11_StepQuiet(command);
    /* Field 8 is USE_ECC608 (use the module's secure-element key instead of
     * the uploaded device-key file), not a generic "verify" toggle - the
     * reference driver explicitly sends 0 here for the file-based cert path
     * used by provision_rnwf11_cert.py. Sending 1 makes the module try to
     * authenticate with its own secure-element identity instead of the
     * uploaded key matching the cert actually registered with AWS IoT.
     * TEMP DIAGNOSTIC: not resending this - it's already 0 in the module's
     * persisted config from an earlier successful run, and re-sending the
     * same value gets rejected with "0.6 Configuration Update Blocked"
     * every boot, which may be leaving the TLS config slot in a state that
     * breaks the MQTTCONN attempt right after it. */

    /* The module's SNTP client never produces a real synced clock on this
     * board (still investigating why), and the TLS stack validates AWS's
     * server certificate against whatever clock it has - a wildly wrong
     * one (module was seen free-running at ~year 2039/2096) makes a
     * perfectly valid server cert look expired/not-yet-valid and the
     * handshake gets rejected. AT+TIME=1,<unix> sets the clock directly,
     * bypassing SNTP - approximate is fine, cert validity windows span
     * years, not seconds. */
    IOTC_RNWF11_StepQuiet("AT+TIME=1,1788998400\r\n");

    snprintf(command, sizeof(command), "AT+MQTTC=1,\"%s\"\r\n", s_cfg.mqtt_broker_host);
    if (!IOTC_RNWF11_Step("MQTTC1-host", command)) return false;
    snprintf(command, sizeof(command), "AT+MQTTC=2,%u\r\n", s_cfg.mqtt_broker_port);
    if (!IOTC_RNWF11_Step("MQTTC2-port", command)) return false;
    snprintf(command, sizeof(command), "AT+MQTTC=3,\"%s\"\r\n", s_cfg.mqtt_client_id);
    if (!IOTC_RNWF11_Step("MQTTC3-clientid", command)) return false;
    /* Match the working RNWF11 flow: use the MQTT protocol version it sets. */
    if (!IOTC_RNWF11_Step("MQTTC8-protocol", "AT+MQTTC=8,3\r\n")) return false;
    /*
     * Always written, even when empty: the module keeps the previous value
     * across resets, and AWS rejects a CONNECT that carries a username.
     */
    snprintf(command, sizeof(command), "AT+MQTTC=4,\"%s\"\r\n", s_cfg.mqtt_username);
    IOTC_RNWF11_StepOptional("MQTTC4-user", command);
    IOTC_RNWF11_StepOptional("MQTTC5-pass", "AT+MQTTC=5,\"\"\r\n");
    if (!IOTC_RNWF11_Step("MQTTC7-tls", "AT+MQTTC=7,1\r\n")) return false;
    if (!IOTC_RNWF11_Step("MQTTC6-keepalive", "AT+MQTTC=6,60\r\n")) return false;
    if (!IOTC_RNWF11_Step("MQTTCONN", "AT+MQTTCONN=1\r\n"))
    {
        return false;
    }

    /* The broker result arrives asynchronously; watch for it rather than guess. */
    for (uint16_t slice = 0; slice < 10000U; slice++)
    {
        __delay_us(500);
        IOTC_RNWF11_PollEvents();
        if (mqttLinkUp)
        {
            break;
        }
    }

    /* Subscriptions don't survive a fresh MQTTCONN (clean session), so this
     * has to be redone on every (re)connect, not just once at boot. */
    if (mqttLinkUp && (s_cfg.mqtt_c2d_topic[0] != '\0'))
    {
        snprintf(command, sizeof(command), "AT+MQTTSUB=\"%s\",1\r\n", s_cfg.mqtt_c2d_topic);
        (void)IOTC_RNWF11_Step("MQTTSUB", command);
    }

    return mqttLinkUp;
}

#define IOTC_RNWF11_ESCAPED_JSON_MAX 256U

/* AT+MQTTPUB wraps the message in "..." with no escaping of its own - any
 * '"' inside the JSON payload prematurely closes that quoted argument. */
static bool IOTC_RNWF11_EscapeJsonForAtCommand(const char *json, char *out, size_t out_size)
{
    size_t o = 0;
    for (size_t i = 0; json[i] != '\0'; i++)
    {
        char c = json[i];
        bool needs_escape = (c == '"') || (c == '\\');
        size_t needed = needs_escape ? 2U : 1U;
        if (o + needed >= out_size)
        {
            return false;
        }
        if (needs_escape)
        {
            out[o++] = '\\';
        }
        out[o++] = c;
    }
    out[o] = '\0';
    return true;
}

static bool IOTC_RNWF11_PublishTelemetry(void)
{
    IotclMessageHandle msg = iotcl_telemetry_create();
    if (msg == NULL)
    {
        DEBUG_Printf("IOTC: iotcl_telemetry_create failed\r\n");
        return false;
    }

    iotcl_telemetry_set_number(msg, "run", telemetry.motorRunning);
    iotcl_telemetry_set_number(msg, "st", telemetry.state);
    iotcl_telemetry_set_number(msg, "sec", telemetry.sector);
    iotcl_telemetry_set_number(msg, "rpm", telemetry.requestedSpeedRpm);
    iotcl_telemetry_set_number(msg, "spd", telemetry.measuredSpeedRpm);
    iotcl_telemetry_set_number(msg, "ic", telemetry.requestedCurrent);
    iotcl_telemetry_set_number(msg, "im", telemetry.measuredCurrent);
    iotcl_telemetry_set_number(msg, "duty", telemetry.dutyCycle);
    iotcl_telemetry_set_number(msg, "vdc", telemetry.dcBusAdc);

